Revit 2015 API
FormatValueOptions.AreValidForUnitType Method
 Checks whether the FormatOptions in this FormatValueOptions is valid for a given unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetFormatOptions().IsValidForUnitType(unitType) instead.")]
public bool AreValidForUnitType(
	UnitType unitType
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetFormatOptions().IsValidForUnitType(unitType) instead.")> _
Public Function AreValidForUnitType ( _
	unitType As UnitType _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use GetFormatOptions().IsValidForUnitType(unitType) instead.")]
public:
bool AreValidForUnitType(
	UnitType unitType
)
Parameters
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type.
Return Value
 True if the FormatOptions is valid, false otherwise.
Remarks
 The FormatOptions is valid if UseDefault is true or if the display unit in the FormatOptions is valid for the unit type. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitType is an invalid unit type. See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FormatValueOptions Class
Autodesk.Revit.DB Namespace